{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Bachelor of Engineering - Electrical Engineering",
      "department": "Electrical and Computer Engineering",
      "duration": "2013-2017",
      "school_name": "Ryerson University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_NasrSyed",
  "highlighted_projects": [
    {
      "description": "Extracted exchange rate data from all countries from CSV, JSON and XML files into a dataframe, transformed currency data, and loaded data into target CSV file. Formulated logging function to track/provide timestamps and logging details of ETL process. (Python, Pandas)",
      "git_url": null,
      "name": "ETL Project for Market Exchange Data"
    },
    {
      "description": "Utilized raw CSV data provided by Chicago Data Portal on socioeconomic factors and crime data. Stored datasets on IBM Db2 and derived SQL queries for insights on health, safety, and environments of Chicago schools. (MySQL, IBM Db2)",
      "git_url": null,
      "name": "SQL Database on IBM Db2"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Architected a routine monitoring agent script which tracked a cluster of nodes/servers running on CentOS 7 Linux distribution. Bash scripts retrieving host hardware, CPU and Memory usage were deployed, and provisioned via Docker. Results were periodically stored into a PostgreSQL database via crontab job.",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Monitoring Agent"
    },
    {
      "description": [
        "Twitter App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "JDBC App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "Grep App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Nasr Syed",
  "others": [
    {
      "bullets": [
        "Data Engineering Professional Certificate - IBM"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Winner"
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        "Learning World History - currently learning about the Ottoman Turks",
        "Weightlifting and exercise",
        "Snowboarding",
        "Marvel comics"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Worked in an Agile/Scrum environment to work on software projects with a team of Software Engineers. Worked as part of a team to design, implement, test and deploy features on a product. Daily scrum meetings were held to discuss issues and to set goals for the day. Weekly code reviews were done by senior developers to ensure code works as expected and to meet standards. Worked on features via tickets and uploaded code to GitHub for version control. To manage branches and features, the GitFlow methodology was followed on all projects.",
      "duration": "Oct 2021-Present",
      "title": "Data Engineer"
    },
    {
      "company": "Morrison Hershfield",
      "description": "Spearheaded technical management and oversight of 100+ electrical projects for 5G tower upgrades. Assisted senior engineers with electrical design and led weekly update meetings on project status.",
      "duration": "Apr 2021 - Oct 2021",
      "title": "Project Coordinator/Electrical Engineer"
    },
    {
      "company": "The HIDI Group",
      "description": "Engineered electrical system design for buildings in accordance with OBC, OESC \u0026 other relevant codes/standards. Designed electrical drawings in AutoCAD.",
      "duration": "Jan 2019 - Jan 2021",
      "title": "Electrical Engineer"
    },
    {
      "company": "Telecon",
      "description": "Liased with Project Engineers, Project Coordinators and CAD technicians to complete Hydro pole assessments. Designed CAD drawings from concept to final release.",
      "duration": "May 2018 - Dec 2018",
      "title": "Design Technician"
    }
  ],
  "skills": {
    "competent": [
      "Docker",
      "MongoDB",
      "Cloud platforms (GCP,AWS)",
      "REST APIs",
      "Numpy/Pandas"
    ],
    "familiar": [
      "Spark",
      "Scala",
      "Hadoop",
      "HTTP Requests",
      "Apache Cassandra"
    ],
    "proficient": [
      "Java",
      "Python",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git/GitFlow/GitHub"
    ]
  },
  "summary": "My name is Nasr Syed, and I am a highly ambitious Data Engineer looking to break his way into the field of Data Analytics. My academic background consists of a Bachelor of Engineering (B.Eng) in Electrical Engineering from Ryerson University, along with a Data Engineering certification from IBM. In terms of my professional work experience, I have been an Electrical Engineer for about 3 years, with the last 6 months in Project Management at top name firms located in Toronto. As displayed by my successful track record, I am someone who thrives, and pushes himself to be an engineer of the highest caliber. Now having found true passion, I am determined to make an impact in the world of big data."
}
